Repository: jimmyl0l3c/cfg-share-links
Catalog: translationfiles/*/cfg_share_links.po
Languages: cs

source: Configurable Share Links
cs: Nastavovatelné odkazy pro sdílení

source: Invalid share type
cs: Neplatný typ sdílení

source: Public link sharing is disabled by the administrator
cs: Používání sdílení typu veřejný odkaz je znepřístupněno správcem

source: Please specify a file or folder path
cs: Zadejte popis umístění souboru či složky

source: Wrong path, file/folder does not exist
cs: Nesprávný popis umístění – soubor/složka neexistuje

source: Could not create share
cs: Nepodařilo se vytvořit sdílení

source: Share not found
cs: Sdílení nenalezeno

source: Insufficient permission
cs: Nedostatečná oprávnění

source: Unable to check permissions
cs: Nepodařilo se zkontrolovat oprávnění

source: Token is not unique
cs: Token už existuje

source: Token is not long enough
cs: Token není dostatečně dlouhý

source: Token contains invalid characters
cs: Token obsahuje neplatné znaky

source: App adding the ability to specify share tokens
cs: Aplikace přidávající možnost zadat podobu tokenů pro sdílení

source: App for Nextcloud that adds the ability to specify share tokens when creating new public links and change tokens of existing links. ## Features Sharing sidebar is expanded by new section (Custom public link) that allows you to create public links with custom share tokens. You can also customize share tokens of existing public links. ## Settings By going to **Settings > Administration > Configurable Share Links** admins can set default labels for custom links and minimal token length. Default label can be: none, same as token or custom (the same custom label for all custom links).
cs: Aplikace pro Nextcloud, která při vytváření nových veřejných odkazů přidává možnost zadávat texty jednotlivých tokenů a měnit tokeny už existujících odkazů. ## Funkce Postranní panel sdílení je rozšířen o novu sekci (Uživatelsky určený veřejný odkaz), která umožňuje vytvářet veřejné odkazy, u kterých určíte, co bude obsahem tokenů jednotlivých sdílení. Je také možné pomocí tohoto upravovat tokenu už existujících veřejných odkazů. ## Nastavení V **Nastavení > Správa > Nastavovatelné odkazy na sdílení** mohou správci nastavit výchozí štítky pro uživatelsky určené odkazy a nejkratší umožněnou délku tokenu. Výchozí štítek může být: žádný, stejný jako token nebo uživatelsky určený (jeden a ten samý pro veškeré uživatelsky určené odkazy).

source: Default share label
cs: Výchozí štítek pro sdílení

source: Configure whether a default label should be set to custom links and what that label should be
cs: Nastavit zda má být uživatelsky určeným odkazům nastavován výchozí štítek a který to v takovém případě má být

source: Default label
cs: Výchozí štítek

source: Select label type
cs: Vybrat typ štítku

source: Custom label
cs: Uživatelsky určený štítek

source: Token settings
cs: Nastavení pro token

source: Configure requirements for tokens
cs: Nastavit, co mají tokeny splňovat

source: Minimal token length
cs: Nejkratší umožněná délka tokenu

source: Miscellaneous
cs: Různé

source: Miscellaneous tweaks
cs: Různá vyladění

source: Keep this option off if you did not use versions lower than 1.2.0
cs: Pokud nepoužíváte verzi starší než 1.2.0, ponechte tuto volbu vypnutou

source: Delete shares of deleted files during token checks (when creating/updating share)
cs: Při kontrole tokenů mazat sdílení už smazaných souborů (při vytváření/aktualizaci sdílení)

source: None
cs: Žádný

source: Same as token
cs: Stejný jako token

source: Custom
cs: Uživatelsky určený

source: Entered length is not a number
cs: Zadaná délka není číslo

source: Minimum length must be at least 1
cs: Je třeba, aby nejkratší umožněná délka tokenu měla hodnotu nejméně 1

source: Label cannot be empty
cs: Štítek je třeba vyplnit

source: Error occurred while saving settings
cs: Došlo k chybě při ukládání nastavení

source: Custom public link
cs: Uživatelsky určený veřejný odkaz

source: Enter custom token
cs: Zadejte uživatelsky určený token

source: Link copied
cs: Odkaz zkopírován

source: Create link
cs: Vytvořit odkaz

source: Invalid token
cs: Neplatný token

source: Custom public link created
cs: Uživatelsky určený veřejný odkaz vytvořen

source: Error occurred while creating public link
cs: Došlo k chybě při vytváření veřejného odkazu

source: Custom public link renamed
cs: Uživatelsky určený veřejný odkaz přejmenován

source: Error occurred while renaming public link
cs: Došlo k chybě při přejmenovávání veřejného odkazu
