Repository: jimmyl0l3c/cfg-share-links
Catalog: translationfiles/*/cfgsharelinks.po
Languages: cs

source: Configurable Share Links
cs: Konfigurovatelné Sdílené Odkazy

source: Invalid share type
cs: Neplatný typ sdílení

source: Public link sharing is disabled by the administrator
cs: Tvorba veřejných odkazů je zakázána administrátorem

source: Please specify a file or folder path
cs: Specifikujte cestu ke složce nebo souboru, prosím

source: Wrong path, file/folder doesn't exist
cs: Neplatná cesta, soubor/složka neexistuje

source: Could not create share
cs: Nepodařilo se vytvořit sdílení

source: Share not found
cs: Sdílení nenalezeno

source: Token is not unique
cs: Token již existuje

source: Token is not long enough
cs: Token je příliš krátký

source: Token contains invalid characters
cs: Token obsahuje neplatné znaky

source: App adding the ability to specify share tokens
cs: Aplikace umožňující uživatelům specifikovat vlastní sdílející tokeny

source: App that allows users to specify share tokens
cs: Aplikace umožňující uživatelům specifikovat vlastní token veřejného odkazu

source: Default share label
cs: Výchozí štítek odkazu

source: Configure whether a default label should be set to custom links and what that label should be
cs: Nastavte, zda by měly mít vlastní odkazy výchozí štítek a jaký by měl být

source: Default label
cs: Výchozí štítek

source: Select label mode
cs: Zvolte mód štítků

source: Custom label
cs: Vlastní štítek

source: Token settings
cs: Nastavení tokenů

source: Configure requirements for tokens
cs: Nastavte požadavky na tokeny

source: Minimal token length
cs: Minimální délka tokenu

source: None
cs: Žádný

source: Same as token
cs: Stejný jako token

source: Custom
cs: Vlastní

source: Entered length is not a number
cs: Zadaná délka není číslo

source: Minimum length must be at least 1
cs: Minimální délka musí být alespoň 1

source: Label can't be empty
cs: Štítek nemůže být prázdný

source: Error occurred while saving settings
cs: Při ukládání nastavení nastala chyba

source: Custom public link
cs: Vlastní veřejný odkaz

source: Enter custom token
cs: Zadejte vlastní token

source: Add
cs: Přidat

source: Custom public link created
cs: Vlastní veřejný odkaz úspěšně vytvořen

source: Error occurred while creating public link
cs: Při vytváření vlastního odkazu nastala chyba

source: Custom public link renamed
cs: Vlastní veřejný odkaz úspěšně přejmenován

source: Error occurred while renaming public link
cs: Při přejmenování vlastního odkazu nastala chyba
